IdentityLogonEvents
| where TimeGenerated <= ago(1d)
| where ActionType == "LogonSuccess"
| where Application == "Active Directory"
| where Protocol in ("Ntlm", "Kerberos")
| summarize count() by Protocol
| render piechart 
